In [5]:
import numpy as np
import pandas as pd

In [6]:
letras = ['a', 'b', 'c']

In [7]:
minha_lista = [10, 20, 30]
array = np.array ([10, 20, 30])
d = {'a' : 10, 'b':20, 'c':30}
print (d)

{'a': 10, 'b': 20, 'c': 30}

In [8]:
serie = pd.Series(data= minha_lista, index= letras )
print (serie)

a    10
b    20
c    30
dtype: int64

In [9]:
serie['c']

np.int64(30)

In [10]:
serie1 = pd.Series(data=[1,2, 3, 4], index= ['EUA', 'Alemanha', 'Brasil', 'japao'])

In [11]:
print (serie1)

EUA         1
Alemanha    2
Brasil      3
japao       4
dtype: int64

In [12]:
serie2 = pd.Series(data=[1,2, 3, 4], index= ['EUA', 'Alemanha', 'Brasil', 'Italia'])

In [13]:
print (serie2)

EUA         1
Alemanha    2
Brasil      3
Italia      4
dtype: int64

In [14]:
import pandas as pd

# Definindo os dados (data)
data = [
    [23, 'São Paulo'],
    [35, 'Rio de Janeiro'],
    [45, 'Belo Horizonte']
]

# Definindo os índices (index)
index = ['Ana', 'Bruno', 'Carlos']

# Definindo os nomes das colunas (columns)
columns = ['Idade', 'Cidade']

# Criando o DataFrame com os três parâmetros
df = pd.DataFrame(data=data, index=index, columns=columns)

# Exibindo o DataFrame
print(df)

        Idade          Cidade
Ana        23       São Paulo
Bruno      35  Rio de Janeiro
Carlos     45  Belo Horizonte

In [15]:
df['Cidade']

Ana            São Paulo
Bruno     Rio de Janeiro
Carlos    Belo Horizonte
Name: Cidade, dtype: object

In [16]:
df = pd.DataFrame(np.random.rand(5, 4), index= ['a', 'b', 'c', 'd', 'e'], columns= ['w', 'x', 'y', 'z'])
print (df)

          w         x         y         z
a  0.919995  0.063680  0.841004  0.704774
b  0.144683  0.797691  0.436900  0.740997
c  0.179083  0.785745  0.260861  0.617275
d  0.173630  0.163217  0.877002  0.995544
e  0.663388  0.564541  0.656098  0.311783

In [17]:
df['new'] = df['w'] + df['x']
print(df)

          w         x         y         z       new
a  0.919995  0.063680  0.841004  0.704774  0.983675
b  0.144683  0.797691  0.436900  0.740997  0.942373
c  0.179083  0.785745  0.260861  0.617275  0.964828
d  0.173630  0.163217  0.877002  0.995544  0.336846
e  0.663388  0.564541  0.656098  0.311783  1.227929

In [18]:
df.drop('new', axis=1)

          w         x         y         z
a  0.919995  0.063680  0.841004  0.704774
b  0.144683  0.797691  0.436900  0.740997
c  0.179083  0.785745  0.260861  0.617275
d  0.173630  0.163217  0.877002  0.995544
e  0.663388  0.564541  0.656098  0.311783

In [19]:
df.loc['a']

w      0.919995
x      0.063680
y      0.841004
z      0.704774
new    0.983675
Name: a, dtype: float64

In [20]:
df.loc['a' ,  'x']

np.float64(0.06368042666682483)

In [21]:
df.loc[['a', 'b'] , ['x', 'y', 'z']]

          x         y         z
a  0.063680  0.841004  0.704774
b  0.797691  0.436900  0.740997

In [22]:
df.iloc[1: 4, 3:]

          z       new
b  0.740997  0.942373
c  0.617275  0.964828
d  0.995544  0.336846

In [24]:
from numpy.random import randn
np.random.seed (101)

In [25]:
df = pd.DataFrame(randn(5, 4), index=['a', 'b', 'c', 'd', 'e'], columns =['c', 'k', 'y', 'z'])

In [26]:
df

          c         k         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [27]:
bol = df > 0

In [28]:
df[bol]

          c         k         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [30]:
df[df['c']> 0]

          c         k         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [31]:
df[df['c']> 0]['y']

a    0.907969
b   -0.848077
d   -0.933237
e    2.605967
Name: y, dtype: float64

In [33]:
df[(df['c']> 0) & (df['y'] > 0)]

          c         k         y         z
a  2.706850  0.628133  0.907969  0.503826
e  0.190794  1.978757  2.605967  0.683509

In [35]:
df[(df['c']> 0) | (df['y'] > 0)]

          c         k         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [36]:
df.reset_index()

  index         c         k         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [37]:
col = 'RS RJ SP AM SC'.split()

In [38]:
col

['RS', 'RJ', 'SP', 'AM', 'SC']

In [39]:
df['estado'] = col

In [40]:
df

          c         k         y         z estado
a  2.706850  0.628133  0.907969  0.503826     RS
b  0.651118 -0.319318 -0.848077  0.605965     RJ
c -2.018168  0.740122  0.528813 -0.589001     SP
d  0.188695 -0.758872 -0.933237  0.955057     AM
e  0.190794  1.978757  2.605967  0.683509     SC

In [41]:
df.set_index('estado')

               c         k         y         z
estado
RS      2.706850  0.628133  0.907969  0.503826
RJ      0.651118 -0.319318 -0.848077  0.605965
SP     -2.018168  0.740122  0.528813 -0.589001
AM      0.188695 -0.758872 -0.933237  0.955057
SC      0.190794  1.978757  2.605967  0.683509

In [42]:
outsider = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
outsider

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [43]:
inside = [1, 2, 3, 1, 2, 3]
inside

[1, 2, 3, 1, 2, 3]

In [44]:
hier_index = list(zip(outsider, inside))

In [45]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [46]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [47]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [48]:
df = pd.DataFrame(np.random.randn(6,2), index = hier_index)

In [49]:
df

             0         1
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [50]:
df.loc['G1'].loc[1]

0    0.302665
1    1.693723
Name: 1, dtype: float64

In [51]:
df.loc['G2'].loc[3]

0    0.638787
1    0.329646
Name: 3, dtype: float64

In [52]:
df.index.names = ['Primeiro', 'Segundo']

In [53]:
df

                         0         1
Primeiro Segundo
G1       1        0.302665  1.693723
         2       -1.706086 -1.159119
         3       -0.134841  0.390528
G2       1        0.166905  0.184502
         2        0.807706  0.072960
         3        0.638787  0.329646

In [54]:
df.xs("G1")

                0         1
Segundo
1        0.302665  1.693723
2       -1.706086 -1.159119
3       -0.134841  0.390528

In [55]:
df.xs(1, level = 'Segundo')

                 0         1
Primeiro
G1        0.302665  1.693723
G2        0.166905  0.184502

In [56]:
d = {'A' : [1, 2, np.nan], 'B' : [5, np.nan, np.nan], 'C' : [1, 2, 3]}

In [57]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [58]:
df = pd.DataFrame(d, index = ['a', 'b', 'c'])

In [59]:
df

     A    B  C
a  1.0  5.0  1
b  2.0  NaN  2
c  NaN  NaN  3

In [60]:
df.dropna(axis=0)

     A    B  C
a  1.0  5.0  1

In [61]:
df.dropna(axis=1)

   C
a  1
b  2
c  3

In [62]:
df.dropna(axis = 1, thresh=2)

     A  C
a  1.0  1
b  2.0  2
c  NaN  3

In [63]:
df.dropna(thresh=2)

     A    B  C
a  1.0  5.0  1
b  2.0  NaN  2

In [64]:
df.fillna(value= 'btf')

     A    B  C
a  1.0  5.0  1
b  2.0  btf  2
c  btf  btf  3

In [65]:
df['A'].fillna(value=df['A'].mean()),

(a    1.0
 b    2.0
 c    1.5
 Name: A, dtype: float64,)

In [ ]:
import numpy as np
import pandas as pd

In [66]:
data =  {
        'Empressa':['Google', 'Google', 'microsoft', 'microsoft', 'Facebook', 'Facebook'],
        'Nome': [' Sam', 'Charlie', 'Amy', 'vanessa', 'Carlos', 'sarah'],
        'Venda': [200, 120,340, 124,243, 250]
}

In [67]:
df = pd.DataFrame(data)

In [68]:
df

    Empressa     Nome  Venda
0     Google      Sam    200
1     Google  Charlie    120
2  microsoft      Amy    340
3  microsoft  vanessa    124
4   Facebook   Carlos    243
5   Facebook    sarah    250

In [69]:
df.groupby('Empressa')

In [70]:
group = df.groupby('Empressa')

In [71]:
group

In [72]:
group.sum()

                  Nome  Venda
Empressa
Facebook   Carlossarah    493
Google      SamCharlie    320
microsoft   Amyvanessa    464

In [73]:
print (df.dtypes)

Empressa    object
Nome        object
Venda        int64
dtype: object

In [74]:
media = group.mean("Empressa")

In [75]:
media

           Venda
Empressa
Facebook   246.5
Google     160.0
microsoft  232.0

In [76]:
group.describe()

          Venda
          count   mean         std    min     25%    50%     75%    max
Empressa
Facebook    2.0  246.5    4.949747  243.0  244.75  246.5  248.25  250.0
Google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [77]:
pessoas = df.groupby("Nome")

In [78]:
pessoas.count()

         Empressa  Venda
Nome
 Sam            1      1
Amy             1      1
Carlos          1      1
Charlie         1      1
sarah           1      1
vanessa         1      1

In [79]:
pessoas = df.groupby("Nome").sum()

In [80]:
pessoas

          Empressa  Venda
Nome
 Sam        Google    200
Amy      microsoft    340
Carlos    Facebook    243
Charlie     Google    120
sarah     Facebook    250
vanessa  microsoft    124

In [82]:
group = df.groupby("Nome")

In [83]:
group.sum().loc['Carlos']

Empressa    Facebook
Venda            243
Name: Carlos, dtype: object

In [84]:
group = df.groupby("Empressa")

In [85]:
group.sum().loc['Google']

Nome      SamCharlie
Venda            320
Name: Google, dtype: object

In [ ]:
import numpy as np
import pandas as pd

In [86]:
df = pd.DataFrame({'col1': [1, 2, 3, 4],
                   'col2': ['444', '555', '666', '444'],
                   'col3': ['abc', 'def', 'ghf', 'xyz']})

In [87]:
df

   col1 col2 col3
0     1  444  abc
1     2  555  def
2     3  666  ghf
3     4  444  xyz

In [88]:
df['col2'].unique

<bound method Series.unique of 0    444
1    555
2    666
3    444
Name: col2, dtype: object>

In [89]:
df['col3'].nunique()

4

In [90]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [91]:
df[df['col1']>2]

   col1 col2 col3
2     3  666  ghf
3     4  444  xyz

In [92]:
df[df['col1']>=2]

   col1 col2 col3
1     2  555  def
2     3  666  ghf
3     4  444  xyz

In [93]:
df[(df['col1'] > 2) & (df['col2'] == '444')]

   col1 col2 col3
3     4  444  xyz

In [94]:
def vezes2 (x):
    return x*2

In [96]:
df['col1'].apply(vezes2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [98]:
del df['col2']

In [99]:
df

   col1 col3
0     1  abc
1     2  def
2     3  ghf
3     4  xyz

In [100]:
df.columns

Index(['col1', 'col3'], dtype='object')

In [101]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [104]:
df.isnull()

    col1   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [105]:
df.dropna()

   col1 col3
0     1  abc
1     2  def
2     3  ghf
3     4  xyz

In [106]:
df = pd.DataFrame({'col1': [1, 2, 3, np.nan],
                   'col2': [np.nan, '555', '666', '444'],
                   'col3': ['abc', 'def', 'ghf', 'xyz']})

In [107]:
df

   col1 col2 col3
0   1.0  NaN  abc
1   2.0  555  def
2   3.0  666  ghf
3   NaN  444  xyz

In [108]:
df['col1'].fillna(value=df['col1'].mean())

0    1.0
1    2.0
2    3.0
3    2.0
Name: col1, dtype: float64

In [111]:
df = pd.read_csv(r'C:\Users\jeffe\OneDrive\Área de Trabalho\Python-para-DataScience-e-Machine-Learning-Apostias\Python-Data-Science-and-Machine-Learning-Bootcamp\2. Python para análise de dados\Pandas\exemplo')

In [112]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [115]:
df.to_csv('exemplojeffinho.csv', sep= ':', decimal = ',')

In [113]:
df = df + 1

In [114]:
df

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [117]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [118]:
df

[                               Bank Name               City          State  \
 0     The First National Bank of Lindsay            Lindsay       Oklahoma
 1  Republic First Bank dba Republic Bank       Philadelphia   Pennsylvania
 2                          Citizens Bank           Sac City           Iowa
 3               Heartland Tri-State Bank            Elkhart         Kansas
 4                    First Republic Bank      San Francisco     California
 5                         Signature Bank           New York       New York
 6                    Silicon Valley Bank        Santa Clara     California
 7                      Almena State Bank             Almena         Kansas
 8             First City Bank of Florida  Fort Walton Beach        Florida
 9                   The First State Bank      Barboursville  West Virginia

     Cert                 Aquiring Institution      Closing Date  \
 0   4134   First Bank & Trust Co., Duncan, OK  October 18, 2024
 1  27332    Fulton Bank, National Association    April 26, 2024
 2   8758            Iowa Trust & Savings Bank  November 3, 2023
 3  25851               Dream First Bank, N.A.     July 28, 2023
 4  59017            JPMorgan Chase Bank, N.A.       May 1, 2023
 5  57053                  Flagstar Bank, N.A.    March 12, 2023
 6  24735  First Citizens Bank & Trust Company    March 10, 2023
 7  15426                          Equity Bank  October 23, 2020
 8  16748            United Fidelity Bank, fsb  October 16, 2020
 9  14361                       MVB Bank, Inc.     April 3, 2020

    Fund  Sort ascending
 0                 10547
 1                 10546
 2                 10545
 3                 10544
 4                 10543
 5                 10540
 6                 10539
 7                 10538
 8                 10537
 9                 10536  ]

In [119]:
df[0]

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
1,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
2,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
3,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
4,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
5,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
6,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
7,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
8,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
9,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536

In [120]:
df[0]['Bank Name']

0       The First National Bank of Lindsay
1    Republic First Bank dba Republic Bank
2                            Citizens Bank
3                 Heartland Tri-State Bank
4                      First Republic Bank
5                           Signature Bank
6                      Silicon Valley Bank
7                        Almena State Bank
8               First City Bank of Florida
9                     The First State Bank
Name: Bank Name, dtype: object

In [122]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B':['B0', 'B1', 'B2', 'B3'],
                    'C':['C0', 'C1', 'C2', 'C3'],
                    'D':['D0', 'D1', 'D2', 'D3']},
                    index = [0, 1, 2, 3])

In [123]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [124]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B':['B4', 'B5', 'B6', 'B7'],
                    'C':['C4', 'C5', 'C6', 'C7'],
                    'D':['D4', 'D5', 'D6', 'D7']},
                    index = [4, 5, 6, 7])

In [125]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [126]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B':['B8', 'B9', 'B10', 'B11'],
                    'C':['C8', 'C9', 'C10', 'C11'],
                    'D':['D8', 'D9', 'D10', 'D11']},
                    index = [8, 9, 10, 11])

In [127]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [128]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [129]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [130]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                         'B': ['B0', 'B1','B2','B3'],
                         'Key': ['K0', 'K1', 'K2', 'K3']})

direita = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                         'D': ['D0', 'D1','D2','D3'],
                         'Key': ['K0', 'K1', 'K2', 'K3']})

In [131]:
esquerda

    A   B Key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [132]:
direita

    C   D Key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [133]:
pd.merge(esquerda, direita, how='inner')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [134]:
pd.merge(esquerda, direita, how='left')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [135]:
pd.merge(esquerda, direita, how='right')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [136]:
pd.merge(esquerda, direita, how='outer')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [137]:
pd.merge(esquerda, direita, how='inner', on = 'Key')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [138]:
esquerda = pd.DataFrame({'Key1': ['K0', 'K0', 'K1', 'K2'],
                         'Key2': ['K0', 'K1','K0','K1'],
                         'A': ['A0', 'A1', 'A2', 'A3'],
                         'B': ['B0', 'B1', 'B2', 'B3']},
                         index = ['W', 'X', 'Y', 'Z'])

direita = pd.DataFrame({'Key1': ['K0', 'K1', 'K1', 'K2'],
                         'Key2': ['K0', 'K0','K0','K0'],
                         'C': ['C0', 'C1', 'C2', 'C3'],
                         'D': ['D0', 'D1', 'D2', 'D3']},
                          index = ['A', 'B', 'C', 'D'])

In [139]:
pd.merge(esquerda,direita, on = ['Key1', 'Key2'])

  Key1 Key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [140]:
pd.merge(esquerda,direita, how = 'right', on = ['Key1', 'Key2'])

  Key1 Key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [142]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                         'B': ['B0', 'B1','B2']},
                         index = ['K0', 'K1', 'K2'])

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                         'D': ['D0', 'D2', 'D3']},
                          index = ['K0', 'K2', 'K3'])

In [143]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [144]:
direita.join(esquerda)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN